wasmino/wasmino-core/boards.txt
# See: http://code.google.com/p/arduino/wiki/Platforms

menu.cpu=Processor

##############################################################

wasmino.name=Wasmino
wasmino.upload.using=gist
wasmino.upload.protocol=gist
wasmino.upload.tool=gist
wasmino.upload.maximum_size=1048576
wasmino.build.mcu=wasm32
wasmino.build.f_cpu=0L
wasmino.build.board=wasmino
wasmino.build.core=wasm32
wasmino.build.variant=wasmino
wasmino.build.compiler.c.flags=-DWASMINO_EXT_NANOSLEEP
wasmino.build.compiler.cpp.flags=-DWASMINO_EXT_NANOSLEEP
wasmino.build.compiler.ld.flags=
wasmino.build.compiler.binaryen_wasm_opt.flags=--asyncify
wasmino.upload.wait_for_upload_port=false
wasmino.upload.use_1200bps_touch=false
wasmino.upload.disable_flushing=false

wasmino_wasi.name=Wasmino (WASI compatible)
wasmino_wasi.upload.using=gist
wasmino_wasi.upload.protocol=gist
wasmino_wasi.upload.tool=gist
wasmino_wasi.upload.maximum_size=1048576
wasmino_wasi.build.mcu=wasm32
wasmino_wasi.build.f_cpu=0L
wasmino_wasi.build.board=wasmino
wasmino_wasi.build.core=wasm32
wasmino_wasi.build.variant=wasmino_wasi
wasmino_wasi.build.compiler.c.flags=
wasmino_wasi.build.compiler.cpp.flags=
wasmino_wasi.build.compiler.ld.flags=
wasmino_wasi.build.compiler.binaryen_wasm_opt.flags=
wasmino_wasi.upload.wait_for_upload_port=false
wasmino_wasi.upload.use_1200bps_touch=false
wasmino_wasi.upload.disable_flushing=false
